"""
Завдання 7. Сформувати список об’єктів Dog, Cat, Cow і в циклі викликати sound()
для кожного елемента, супроводивши виконання коротким поясненням того, як у
Python працює пізнє зв’язування (динамічна диспетчеризація методів під час
виконання).
"""

class Animal:
    def sound(self):
        raise NotImplemented

class Dog(Animal):
    def sound(self):
        print("woof")

class Cat(Animal):
    def sound(self):
        print("meow")

class Cow(Animal):
    def sound(self):
        print("moo")


animals = [Dog(), Cat(), Cow()]
for animal in animals:
    animal.sound()

print('''\n   Пізнє зв'язування, або ж динамічна диспетчеризація — це механізм в програмуванні,
при якому визначення того, який метод чи функцію викликати, виникає під час виконання
програми, а не компіляції. 
    В нашому випадку при виклику методу sound інтерпретатор спочатку шукає його в реалізації
класу, а вже потім, якщо його там не знайдено, йде до батьківських класів в пошуках реалізації
цього методу там.
''')